app/Http/Controllers/API/CartAPIController.php

    public function index(Request $request)
    {
        try{
            $this->cartRepository->pushCriteria(new RequestCriteria($request));
            $this->cartRepository->pushCriteria(new LimitOffsetCriteria($request));
        } catch (RepositoryException $e) {
            Flash::error($e->getMessage());
        }
        $carts = $this->cartRepository->all();

        $custum_Arr = $carts->toArray();
        foreach ($carts as $key => $value)
        {
            $getRelationData = $value['extras'];

            $cartextras = Cart_extras::select('cart_id','extra_qty','extra_price')->where('cart_id',$value['id'])->get()->toArray();
---
select `cart_id`, `extra_qty`, `extra_price` from `cart_extras` where `cart_id` = 6