app/Http/Controllers/API/FoodAPIController.php

select `foods`.* from `foods` inner join `restaurants` on `foods`.`restaurant_id` = `restaurants`.`id` where `restaurants`.`res_category_id` = '1' and `foods`.`restaurant_id` = '4' order by `foods`.`id` asc
---
    public function index(Request $request)
    {
        /*try{
            $this->foodRepository->pushCriteria(new RequestCriteria($request));
            $this->foodRepository->pushCriteria(new LimitOffsetCriteria($request));
        } catch (RepositoryException $e) {
            return $this->sendError($e->getMessage());
        }
        $foods = $this->foodRepository->all();*/

        $res_category_id = $request->input('res_category_id');
        $restaurant_id = $request->input('restaurant_id');
        $category_id = $request->input('categoryid');
        $limit = $request->input('limit');

        $foods = Food::select('foods.*')
                ->join('restaurants','foods.restaurant_id','=','restaurants.id');
                if(isset($res_category_id) && $res_category_id != ''){
                   $foods = $foods->where('restaurants.res_category_id',$res_category_id);
                }
                if(isset($category_id) && $category_id != ''){
                    $foods = $foods->where('foods.category_id',$category_id);
                }
                if(isset($restaurant_id) && $restaurant_id != ''){
                    $foods = $foods->where('foods.restaurant_id',$restaurant_id);
                }
                $foods = $foods->orderBy('foods.id')
                ->limit($limit)->get();