app/Http/Controllers/API/FoodCategoryAPIController.php

select * from `foods` where `foods`.`category_id` in (1, 2, 3, 4, 5)
select `categories`.* from `categories` order by `categories`.`id` asc
select * from `foods` where `foods`.`category_id` = 1 and `foods`.`category_id` is not null
select `foods`.* from `foods` inner join `restaurants` on `foods`.`restaurant_id` = `restaurants`.`id` where `foods`.`category_id` = 1 and `restaurants`.`res_category_id` = '1'
---
    public function index(Request $request)
    {
        $res_category_id = $request->input('res_category_id');
        $restaurant_id = $request->input('restaurant_id');

        $category_foods = Category::select('categories.*')->with('foods');

        $category_foods = $category_foods->orderBy('categories.id')->get();

        $Arr = $category_foods->toArray();

        foreach ($category_foods as $key => $value) {

            $relationData = $value->foods()->get();
            foreach ($relationData as $rkey => $rvalue) {

            $data = Food::select('foods.*')
                ->join('restaurants','foods.restaurant_id','=','restaurants.id')->where('foods.category_id',$value->id);
                if(isset($res_category_id) && $res_category_id != ''){
                    $data = $data->where('restaurants.res_category_id',$res_category_id);
                }
                if(isset($restaurant_id) && $restaurant_id != ''){
                    $data = $data->where('restaurants.id',$restaurant_id);
                }
                $data = $data->get();