app/Http/Controllers/API/OfferAPIController.php

select * from `offer` where `is_active` = '1'
---
    public function index(Request $request)
    {
        $res_category_id = $request->input('res_category_id');

        try{
            $this->offerRepository->pushCriteria(new RequestCriteria($request));
            $this->offerRepository->pushCriteria(new LimitOffsetCriteria($request));
        } catch (RepositoryException $e) {
            Flash::error($e->getMessage());
        }

        $offer = $this->offerRepository->where('is_active','1')->get();