app/DataTables/DriversDataTable.php

select * from `custom_fields` where `custom_field_model` = 'App\Models\User' and `in_table` = 1
---
        // TODO custom element generator
        $hasCustomField = in_array(User::class, setting('custom_field_models',[]));
        if ($hasCustomField) {
            $customFieldsCollection = CustomField::where('custom_field_model', User::class)->where('in_table', '=', true)->get();