app/Repositories/RestaurantRepository.php

    public function nearwithoutsearch($myLon, $myLat, $areaLon, $areaLat, $res_category_id)
    {
        $results = $this->model->select(DB::raw("SQRT(
            POW(69.1 * (restaurants.latitude - " . $myLat . "), 2) +
            POW(69.1 * (" . $myLon . " - restaurants.longitude) * COS(restaurants.latitude / 57.3), 2)) AS distance, SQRT(
            POW(69.1 * (restaurants.latitude - " . $areaLat . "), 2) +
            POW(69.1 * (" . $areaLon . " - restaurants.longitude) * COS(restaurants.latitude / 57.3), 2)) AS area"), "restaurants.*")
                    ->join('foods','foods.restaurant_id','=','restaurants.id');

        if(isset($res_category_id) && $res_category_id != '')
        {
            $results = $results->where('restaurants.res_category_id',$res_category_id);
        }

        $results = $results->groupBy('restaurants.id');
        $results = $results->orderBy('distance','asc');
        $results = $results->get();
---
select SQRT(
POW(69.1 * (restaurants.latitude - 32.69973754999999), 2) +
POW(69.1 * (35.05452703999999 - restaurants.longitude) * COS(restaurants.latitude / 57.3), 2)) AS distance, SQRT(
POW(69.1 * (restaurants.latitude - 32.69973754999999), 2) +
POW(69.1 * (35.05452703999999 - restaurants.longitude) * COS(restaurants.latitude / 57.3), 2)) AS area, `restaurants`.* from `restaurants` inner join `foods` on `foods`.`restaurant_id` = `restaurants`.`id` where `restaurants`.`res_category_id` = '1' group by `restaurants`.`id` order by `distance` asc